app/Controllers/CustomerController.php

SELECT *
FROM `customers`
WHERE `user_id` = '1'
 LIMIT 1
---
    public function showProfile(): string
    {
        $userId = user_id();
        $data = $this->customerModel->where('user_id', $userId)->first();