app/Controllers/ProductController.php

SELECT `products`.*, `categories`.`name` as `category`
FROM `products`
JOIN `categories` ON `categories`.`id` = `products`.`category_id`
---
    public function getAllProducts()
    {
        // $search = $this->request->getGet('search') ?? '';
        // $filter = $this->request->getGet('filter') ?? '';
        $data['products'] = $this->productModel->withCategory()->findAll();

SELECT *
FROM `categories`
---
    public function new(): string
    {
        $data['categories'] = $this->categoryModel->findAll();