app/Controllers/RoleController.php

SELECT *
FROM `auth_groups`
---
    public function showRoles()
    {
        $data['roles'] =  $this->groupModel->findAll();

INSERT INTO `auth_groups` (`name`, `description`) VALUES ('Hidayat', 'asdadwadadad')
---
    public function store()
    {
        $data = $this->request->getPost();
        $group = new Group($data);
        if (! $this->groupModel->save($group)) {

DELETE FROM `auth_groups`
WHERE `id` IN ('6')
---
    public function delete($id)
    {
        $this->groupModel->delete($id);