app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '7'
---
    public function detail($id)
    {
        $data['user'] = $this->userModel->find($id);