app/Controllers/UserController.php

SELECT *
FROM `users`
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
    public function index()
    {
        $data = [
            'title' => 'User Management',
            'users' => $this->userModel->findAll()
        ];

SELECT *
FROM `auth_groups`
---
    public function create()
    {
        $data = [
            'title' => 'Add New User',
            'groups' => $this->groupModel->findAll(),

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '11'
SELECT *
FROM `auth_groups`
---
    public function edit($id)
    {
        $data = [
            'title' => 'Edit User',
            'user' => $this->userModel->find($id),
            'groups' => $this->groupModel->findAll(),

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '11'
---
    public function update($id)
    {
        $user = $this->userModel->find($id);

UPDATE `users` SET `email` = 'kirandz24567@yopmail.com', `username` = 'dayatgantengaja23', `active` = 0, `updated_at` = '2025-03-14 08:05:03'
WHERE `users`.`id` IN ('11')
---
        }

        // Simpan data
        if (!$this->userModel->save($user)) {

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '11'
UPDATE `users` SET `deleted_at` = '2025-03-14 16:12:38', `updated_at` = '2025-03-14 16:12:38'
WHERE `id` IN ('11')
AND `deleted_at` IS NULL
---
    public function delete($id)
    {
        $user = $this->userModel->find($id);

        if (empty($user)) {
            return redirect()->to('/users')->with('error', 'User tidak ditemukan');
        }

        $this->userModel->delete($id);