app/Models/CategoryModel.php

SELECT DISTINCT `name`
FROM `categories`
---
    public function getAllCategories()
    {
        $categories = $this->select('name')->distinct()->findAll();