app/Models/ProductModel.php

SELECT `products`.*, `categories`.`name` as `category`
FROM `products`
JOIN `categories` ON `categories`.`id` = `products`.`category_id`
JOIN `product_images` ON `product_images`.`id` = `products`.`category_id`
WHERE `products`.`status` = 'active'
---
    public function findListActiveProducts()
    {
        return $this->withCategory()->where('products.status', 'active')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `products`
---
        $result = [
            'products' => $this->paginate($params->perPage, 'products', $params->page_products),
            'pager' => $this->pager,
            'total' => $this->countAllResults(false)

SELECT DISTINCT `price`
FROM `products`
---
    public function getAllPrices()
    {
        $ranges = [];
        $prices = $this->select('price')->distinct()->findAll();